In [17]:
import pandas as pd

In [18]:
#Read formatted UKDALE mains CSV to pandas Dataframe.
UK_h1 = pd.read_csv(r'C:\Users\44749\NILM\nilm_analyzer_EM401\Processed Data\Load Profile Data\UK_h1_WM_formatted.csv', index_col=1)
R_h3 = pd.read_csv(r'C:\Users\44749\NILM\nilm_analyzer_EM401\Processed Data\Load Profile Data\R_h3_WM_formatted.csv', index_col=1)
R_h1 = pd.read_csv(r'C:\Users\44749\NILM\nilm_analyzer_EM401\Processed Data\Load Profile Data\R_h1_WM_formatted.csv', index_col=1)
R_h5 = pd.read_csv(r'C:\Users\44749\NILM\nilm_analyzer_EM401\Processed Data\Load Profile Data\R_h5_WM_formatted.csv', index_col=1)

In [19]:
UK_h1.head()

              Unnamed: 0  aggregate  washing_machine
time
1.404169e+09           0      213.0              0.0
1.404169e+09           1      216.0              0.0
1.404169e+09           2      216.0              0.0
1.404169e+09           3      214.0              0.0
1.404169e+09           4      217.0              0.0

In [20]:
UK_h1.drop(columns = 'Unnamed: 0', inplace = True)

In [21]:
R_h3.drop(columns = 'Unnamed: 0', inplace = True)

In [22]:
R_h1.drop(columns = 'Unnamed: 0', inplace = True)

In [23]:
R_h5.drop(columns = 'Unnamed: 0', inplace = True)

In [24]:
R_h1.rename(columns = {'washing machine':'washing_machine'}, inplace= True)
R_h5.rename(columns = {'washing machine':'washing_machine'}, inplace= True)
R_h3.rename(columns = {'washing machine':'washing_machine'}, inplace= True)

In [25]:
R_h1.head()

              aggregate  washing_machine
time
1.404169e+09      245.0              0.0
1.404169e+09      242.0              0.0
1.404169e+09      242.0              0.0
1.404169e+09      245.0              0.0
1.404169e+09      245.0              0.0

In [26]:
#Establishes frames to concatenate.
frames = [UK_h1, R_h3, R_h1, R_h5]

In [27]:
#Concatenates the frames with keys correseponding to the house data sets taken from.
df_concat = pd.concat(frames)

In [28]:
df_concat.head()

              aggregate  washing_machine
time
1.404169e+09      213.0              0.0
1.404169e+09      216.0              0.0
1.404169e+09      216.0              0.0
1.404169e+09      214.0              0.0
1.404169e+09      217.0              0.0

In [30]:
#Converts Dataframe to CSV.
df_concat.to_csv(r'C:\Users\44749\NILM\nilm_analyzer_EM401\Processed Data\Load Profile Data\UK_R_h1-5_WM_july_2014.csv')

In [37]:
x = pd.read_csv(r'C:\Users\44749\NILM\nilm_analyzer_EM401\Processed Data\Load Profile Data\UK_R_h1-5_WM_july_2014.csv', index_col=0)

In [38]:
y = pd.read_csv(r'C:\Users\44749\NILM\nilm_analyzer_EM401\Processed Data\Load Profile Data\UK_R_h1-5_july_2014.csv', index_col=0)

In [39]:
x.head()

              aggregate  washing_machine
time
1.404169e+09      213.0              0.0
1.404169e+09      216.0              0.0
1.404169e+09      216.0              0.0
1.404169e+09      214.0              0.0
1.404169e+09      217.0              0.0

In [40]:
z = x['washing_machine']

In [41]:
print(z)

time
1.404169e+09    0.0
1.404169e+09    0.0
1.404169e+09    0.0
1.404169e+09    0.0
1.404169e+09    0.0
               ...
1.406848e+09    0.0
1.406848e+09    0.0
1.406848e+09    0.0
1.406848e+09    0.0
1.406848e+09    0.0
Name: washing_machine, Length: 1785600, dtype: float64

In [42]:
frames2 = [y,z]

In [43]:
concat = pd.concat(frames2, axis = 1)

In [44]:
concat.head()

              aggregate  dishwasher  washing_machine
time
1.404169e+09      213.0         0.0              0.0
1.404169e+09      216.0         0.0              0.0
1.404169e+09      216.0         0.0              0.0
1.404169e+09      214.0         0.0              0.0
1.404169e+09      217.0         1.0              0.0

In [45]:
concat = concat.reindex(columns=['dishwasher', 'washing_machine', 'aggregate'])

In [46]:
concat.head()

              dishwasher  washing_machine  aggregate
time
1.404169e+09         0.0              0.0      213.0
1.404169e+09         0.0              0.0      216.0
1.404169e+09         0.0              0.0      216.0
1.404169e+09         0.0              0.0      214.0
1.404169e+09         1.0              0.0      217.0

In [47]:
concat.to_csv(r'C:\Users\44749\NILM\nilm_analyzer_EM401\Processed Data\Load Profile Data\UK_R_h1-5_agg_july_2014.csv')